using System;

public class Program
{
	public static void Main(string[] args)
		
	{
		//Найдите сумму  1+2+3+…+n, где число n вводится пользователем с клавиатуры.

	//int n;
	
	Console.WriteLine(1 + 2 + 3 + (Convert.ToInt32(Console.ReadLine())));
	
	}
}
