using System;

public class Program
{
	public static void Main(string[] args)
	{
		//Напишите программу, которая выводит квадраты нечетных целых чисел от 1 до предела который вводит пользователь.
		
for (int i = 1; i <= 11; i++)
    if (i % 2 != 0)
	Console.WriteLine(i * i);
	}
}
